Revit 2027 API
TransmissionData.WriteTransmissionData Method
 Writes the given TransmissionData into the Revit file at the given location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void WriteTransmissionData(
	ModelPath path,
	TransmissionData data
)
Public Shared Sub WriteTransmissionData (
	path As ModelPath,
	data As TransmissionData
)
public:
static void WriteTransmissionData(
	ModelPath^ path,
	TransmissionData^ data
)
static member WriteTransmissionData :
        path : ModelPath *
        data : TransmissionData -> unit
Parameters
path ModelPath
 A ModelPath indicating the file Revit should write the TransmissionData of. This ModelPath must be a file path and an absolute path.
data TransmissionData
 The TransmissionData to be written into the document. Note that Revit will not check that the ElementIds in the TransmissionData correspond to real Elements.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
FileArgumentNotFoundException |  There is not a valid Revit file at path's location
InvalidOperationException |  Operation is not valid for Revit Server models. -or- This function cannot be called on an opened document.
Remarks
This function will overwrite the existing TransmissionData in the file.
This function will not support models on Revit Server. References may be to Revit Server, but the host model must be local.
This function must be called on a closed document.
This function cannot be used to convert a reference from a local file to an external server.
See Also
Reference
TransmissionData Class
Autodesk.Revit.DB Namespace